{"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Yl9npCt8n6m-","outputId":"592311b0-bf3d-4688-be18-509184fc5241","executionInfo":{"status":"ok","timestamp":1728832718344,"user_tz":-120,"elapsed":9227,"user":{"displayName":"jose ma","userId":"11659573902744933155"}}},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting rdflib\n","  Downloading rdflib-7.0.0-py3-none-any.whl.metadata (11 kB)\n","Collecting isodate<0.7.0,>=0.6.0 (from rdflib)\n","  Downloading isodate-0.6.1-py2.py3-none-any.whl.metadata (9.6 kB)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.10/dist-packages (from rdflib) (3.1.4)\n","Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n","Downloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m7.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m1.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.1 rdflib-7.0.0\n"]}],"source":["!pip install rdflib\n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2024-2025/master/Assignment4/course_materials\""]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["First let's read the RDF file"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9ERh415on7kF","outputId":"d9eea0b5-7333-47df-c8ec-e4f5e132201d","executionInfo":{"status":"ok","timestamp":1728832971767,"user_tz":-120,"elapsed":738,"user":{"displayName":"jose ma","userId":"11659573902744933155"}}},"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N56aaa5181fda4a698370195659593c03 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{},"execution_count":2}],"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/rdf/example6.rdf\", format=\"xml\")"]},{"cell_type":"code","source":["for s, p, o in g:\n","  print(s, p, o)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9y-NVEp1lS9X","executionInfo":{"status":"ok","timestamp":1728832973453,"user_tz":-120,"elapsed":267,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"03c0d57d-0d8d-41de-97e8-8d35e7649d03"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given http://www.w3.org/2000/01/rdf-schema#range http://www.w3.org/2001/XMLSchema#string\n","http://somewhere#Bugs http://xmlns.com/foaf/0.1/knows http://somewhere#RockySmith\n","http://somewhere#Researcher http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#PhDstudent http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Property\n","http://somewhere#SaraJones http://xmlns.com/foaf/0.1/age 22\n","http://somewhere#SaraJones http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#JohnSmith http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN http://www.w3.org/2000/01/rdf-schema#range http://www.w3.org/2001/XMLSchema#string\n","http://somewhere#Person http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#LivingThing\n","http://somewhere#JimGonzalez http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Professor\n","http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#Animal http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#Bugs http://xmlns.com/foaf/0.1/knows http://somewhere#SaraJones\n","http://somewhere#JimGonzalez http://www.w3.org/2001/vcard-rdf/3.0/FN Jim Gonzalez\n","http://somewhere#Bugs http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Animal\n","http://somewhere#JaneSmith http://www.w3.org/2001/vcard-rdf/3.0/FN Jane Smith\n","http://somewhere#Bugs http://xmlns.com/foaf/0.1/age 2\n","http://somewhere#JimGonzalez http://www.w3.org/2001/vcard-rdf/3.0/Given Jim\n","http://somewhere#RockySmith http://xmlns.com/foaf/0.1/knows http://somewhere#JaneSmith\n","http://somewhere#RockySmith http://www.w3.org/2001/vcard-rdf/3.0/Given Rocky\n","http://somewhere#Professor http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Person\n","http://somewhere#JaneSmith http://xmlns.com/foaf/0.1/age 30\n","http://somewhere#UPM http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#University\n","http://somewhere#PhDstudent http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Researcher\n","http://somewhere#Researcher http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Person\n","http://somewhere#University http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#Bugs http://www.w3.org/2001/vcard-rdf/3.0/Given Bugs\n","http://somewhere#JaneSmith http://xmlns.com/foaf/0.1/knows http://somewhere#RockySmith\n","http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Datatype\n","http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family http://www.w3.org/2000/01/rdf-schema#range http://www.w3.org/2001/XMLSchema#string\n","http://somewhere#SaraJones http://xmlns.com/foaf/0.1/knows http://somewhere#JaneSmith\n","http://somewhere#JohnSmith http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#SaraJones http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#LivingThing http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n","http://somewhere#RockySmith http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://xmlns.com/foaf/0.1/knows http://somewhere#RockySmith\n","http://somewhere#JohnSmith http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JimGonzalez http://www.w3.org/2001/vcard-rdf/3.0/Family Gonzalez\n","http://somewhere#Animal http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#LivingThing\n","http://somewhere#Bugs http://xmlns.com/foaf/0.1/knows http://somewhere#JaneSmith\n","http://somewhere#JimGonzalez http://xmlns.com/foaf/0.1/age 40\n","http://somewhere#RockySmith http://xmlns.com/foaf/0.1/knows http://somewhere#SaraJones\n","http://somewhere#RockySmith http://www.w3.org/2001/vcard-rdf/3.0/FN Rocky Smith\n","http://somewhere#Professor http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n","http://somewhere#RockySmith http://xmlns.com/foaf/0.1/age 10\n","http://somewhere#JaneSmith http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://xmlns.com/foaf/0.1/knows http://somewhere#SaraJones\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://xmlns.com/foaf/0.1/age 20\n","http://somewhere#RockySmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Animal\n","http://somewhere#RockySmith http://xmlns.com/foaf/0.1/knows http://somewhere#Bugs\n","http://somewhere#Person http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n"]}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"LivingThing\" with RDFLib and SPARQL**"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"tRcSWuMHOXBl","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728833009334,"user_tz":-120,"elapsed":280,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"9d2da49a-527d-4054-9761-1a6f0ee77551"},"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#Person'),)\n","(rdflib.term.URIRef('http://somewhere#Animal'),)\n","http://somewhere#Person\n","http://somewhere#Animal\n"]}],"source":["# TO DO\n","from rdflib.plugins.sparql import prepareQuery\n","ns = Namespace(\"http://somewhere#\")\n","\n","q1 = prepareQuery('''\n","  SELECT ?subclase WHERE {\n","    ?subclase rdfs:subClassOf ns:LivingThing\n","  }\n","  ''',\n","  initNs = { \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n",")\n","\n","# Visualize the results\n","for r in g.query(q1):\n","  print(r)\n","\n","for s, p, o in g.triples((None, RDFS.subClassOf, ns.LivingThing)):\n","  print(s)"]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"LiKSPHRzS-XJ","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728833299308,"user_tz":-120,"elapsed":224,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"40ea8d8a-0407-4654-a750-f4bf9bafb208"},"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n","(rdflib.term.URIRef('http://somewhere#JimGonzalez'),)\n","(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n","http://somewhere#JaneSmith\n","http://somewhere#JimGonzalez\n","http://somewhere#SaraJones\n","http://somewhere#JohnSmith\n"]}],"source":["# TO DO\n","q2 = prepareQuery('''\n","  SELECT ?individuo WHERE {\n","    {?subclase rdfs:subClassOf ns:Person .\n","    ?individuo rdf:type ?subclase} UNION {\n","      ?individuo rdf:type ns:Person\n","    }\n","  }\n","  ''',\n","  initNs = {\"rdf\": RDF, \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n","  )\n","\n","# Visualize the results\n","for r in g.query(q2):\n","  print(r)\n","\n","for s, p, o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  for s2, p2, o2 in g.triples((None, RDF.type, s)):\n","    print(s2)\n","for s, p, o in g.triples((None, RDF.type, ns.Person)):\n","  print(s)"]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of just \"Person\" or \"Animal\". You do not need to list the individuals of the subclasses of person (in SPARQL only)**\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"APQGv3NHX8Tf","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728506408358,"user_tz":-120,"elapsed":246,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"9340348e-48f7-4f4b-d160-0b649e84a9b6"},"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n","(rdflib.term.URIRef('http://somewhere#RockySmith'),)\n","(rdflib.term.URIRef('http://somewhere#Bugs'),)\n"]}],"source":["# TO DO\n","q3 = prepareQuery('''\n","  SELECT ?individuo WHERE {\n","    ?subclase rdfs:subClassOf ns:LivingThing .\n","    ?individuo rdf:type ?subclase .\n","  }\n","  ''',\n","  initNs = {\"rdf\": RDF, \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n","  )\n","\n","\n","# Visualize the results\n","for r in g.query(q3):\n","  print(r)"]},{"cell_type":"markdown","source":["**TASK 7.4:  List the name of the persons who know Rocky (in SPARQL only)**"],"metadata":{"id":"3NyI7M2VNr9R"}},{"cell_type":"code","source":["# TO DO\n","from rdflib import FOAF\n","q4 = prepareQuery('''\n","  SELECT ?individuo WHERE {\n","    {?subclase rdfs:subClassOf ns:Person .\n","    ?individuo rdf:type ?subclase} UNION\n","    {?individuo rdf:type ns:Person}\n","    ?individuo foaf:knows ns:RockySmith .\n","  }\n","  ''',\n","  initNs = {\"foaf\": FOAF, \"rdf\": RDF, \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n","  )\n","\n","# Visualize the results\n","for r in g.query(q4):\n","  print(r)"],"metadata":{"id":"I_CNoIKdNpbx","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728507468712,"user_tz":-120,"elapsed":267,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"6b04d3d6-7bf7-49bc-c7c6-8dcb1deb8a27"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n","(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n"]}]},{"cell_type":"markdown","source":["**Task 7.5: List the name of those animals who know at least another animal in the graph (in SPARQL only)**"],"metadata":{"id":"kyjGsyxDPa2C"}},{"cell_type":"code","source":["# TO DO\n","q5 = prepareQuery('''\n","  SELECT ?animal WHERE {\n","    ?animal rdf:type ns:Animal .\n","    ?animal_otro rdf:type ns:Animal .\n","    ?animal foaf:knows ?animal_otro .\n","  }\n","  ''',\n","  initNs = {\"foaf\": FOAF, \"rdf\": RDF, \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n","  )\n","# Visualize the results\n","for r in g.query(q5):\n","  print(r)"],"metadata":{"id":"yoVwVZUAPaLm","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728506932112,"user_tz":-120,"elapsed":265,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"f90c77ca-49f3-459a-fe73-d219be175d8e"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://somewhere#RockySmith'),)\n","(rdflib.term.URIRef('http://somewhere#Bugs'),)\n"]}]},{"cell_type":"markdown","source":["**Task 7.6: List the age of all living things in descending order (in SPARQL only)**"],"metadata":{"id":"oU_Rd2ByXBaV"}},{"cell_type":"code","source":["# TO DO\n","q6 = prepareQuery('''\n","  SELECT ?age WHERE {\n","    {\n","      SELECT DISTINCT ?thing WHERE {\n","        {\n","          ?subclase rdfs:subClassOf ns:LivingThing .\n","          ?thing rdf:type ?subclase .} UNION\n","        {\n","          ?ser rdfs:subClassOf ?subclase .\n","          ?thing rdf:type ?ser}\n","      }\n","    }\n","    ?thing foaf:age ?age\n","  } ORDER BY DESC(?age)\n","  ''',\n","  initNs = {\"foaf\": FOAF, \"rdf\": RDF, \"rdfs\": RDFS, \"ns\": \"http://somewhere#\"}\n","  )\n","# Visualize the results\n","for r in g.query(q6):\n","  print(r)\n"],"metadata":{"id":"KPL9SUPiXEJZ","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1728508316623,"user_tz":-120,"elapsed":272,"user":{"displayName":"jose ma","userId":"11659573902744933155"}},"outputId":"963799af-69cb-4680-beda-c688d4497aa2"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.Literal('40', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n","(rdflib.term.Literal('30', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n","(rdflib.term.Literal('22', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n","(rdflib.term.Literal('20', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n","(rdflib.term.Literal('10', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n","(rdflib.term.Literal('2', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n"]}]}],"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.5"}},"nbformat":4,"nbformat_minor":0}